Conf.Simple/src/DataProcessors/SUI_ИмпортЭкспортНастроек/SUI_ИмпортЭкспортНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_ИмпортЭкспортНастроек</name>
</mdclass:DataProcessor>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/SUI_ДополнительныеНастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДополнительныеНастройкиТаблицИнтеграции</name>
  <resources>
    <name>ДанныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/DataProcessors/SUI_ИмпортЭкспортНастроек/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Импорт экспорт настроек'") + ?(ПустаяСтрока(ВложенноеСобытие), "", "." + ВложенноеСобытие);
КонецФункции

Функция ИндексКартинкиКаталога() Экспорт
	Возврат 2;
КонецФункции

Функция ИндексКартинкиФайла() Экспорт
	Возврат 10;
КонецФункции

// Области настроек.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из Строка - Области настроек
Функция ОбластиНастроек() Экспорт
	
	Области = Новый Массив();
	Области.Добавить("Настройки документов");
	Области.Добавить("Настройки подсистемы");
	
	Возврат Новый ФиксированныйМассив(Области);
	
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Если Значение <> Неопределено Тогда
	
		ТипЗначения = XMLТипЗнч(Значение).ИмяТипа;
		
		Если СтрНайти(ТипЗначения, "Ref.") > 0 Или ТипЗначения = "UUID" Тогда
			Возврат XMLСтрока(Значение);
		КонецЕсли;

	КонецЕсли;

КонецФункции

Процедура ВыгрузитьВФайл(Параметры, АдресРезультата) Экспорт
	
	НомерОбластиНастройки = ОбластиНастроек().Найти(Параметры.Область);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НомерОбластиНастройки <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Параметры.Область));
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Параметры.ДеревоНастройки.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина).Количество() > 0,
		НСтр("ru = 'Отсутствуют данные для выгрузки.'"));
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	
	Попытка
		
		// Область: Настройки документов
		Если НомерОбластиНастройки = 0 Тогда
			ВыгрузитьВФайлы_НастройкиДокументов(ВременныйКаталог, Параметры.ДеревоНастройки);
			
		// Область: Настройки подсистемы
		ИначеЕсли НомерОбластиНастройки = 1 Тогда
			ВыгрузитьВФайлы_НастройкиПодсистемы(ВременныйКаталог, Параметры.ДеревоНастройки);
		КонецЕсли;
		
		// Файл области настроек
		ЗаписатьКонфигурационныйФайлНастроек(ВременныйКаталог, Параметры.Область);
		
		АрхивНастроек = СформироватьАрхив(ВременныйКаталог);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
		ПоместитьВоВременноеХранилище(АрхивНастроек, АдресРезультата);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Выгрузка в файл'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек(Параметры, АдресРезультата) Экспорт
	
	НомерОбластиНастройки = ОбластиНастроек().Найти(Параметры.Область);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НомерОбластиНастройки <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Параметры.Область));
	
	Параметры.НастройкиДерево.Строки.Очистить();
	
	Если Параметры.Свойство("ДанныеФайла") Тогда
		ЗаполнитьДеревоНастроек_ИзФайлаВыгрузки(Параметры.НастройкиДерево, Параметры.ДанныеФайла, Параметры.Область);
	ИначеЕсли Параметры.Свойство("ДанныеКарты") Тогда
		ЗаполнитьДеревоНастроек_ИзСхемы(Параметры.НастройкиДерево, Параметры.ДанныеКарты, Параметры.Область);
	ИначеЕсли Параметры.Свойство("ЭтоВыгрузка") Тогда
		
		Если НомерОбластиНастройки = 0 Тогда
			ЗаполнитьДеревоНастроек_НастройкиДокументов(Параметры.НастройкиДерево);
		ИначеЕсли НомерОбластиНастройки = 1 Тогда
			ЗаполнитьДеревоНастроек_НастройкиПодсистемы(Параметры.НастройкиДерево);
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Параметры.НастройкиДерево, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьАрхив(Каталог)
	
	ФайлАрхив = Новый ЗаписьZipФайла();
	ФайлАрхив.Добавить(
		SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, "*.*"), 
		РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
		РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	
	Возврат ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
	
КонецФункции

Функция ПараметрыПоискаОтмеченныхНастроек()
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("ИндексКартинки", ИндексКартинкиФайла());
	ПараметрыПоиска.Вставить("Пометка", 1);
	
	Возврат ПараметрыПоиска;
	
КонецФункции

Процедура ПроставитьПометкиВверх(СтрокаДерева)
	
	РодительСтроки = СтрокаДерева.Родитель;
	
	Если РодительСтроки <> Неопределено Тогда
		
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		
		Для Каждого Потомок Из РодительСтроки.Строки Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		
		ПроставитьПометкиВверх(РодительСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДанныеНастройкиВДерево(СтрокиДерева, Знач ПутьФайла, РазделительПути, ПутьВКаталоге, Приложение, ЭтоКаталог)
	
    ПозицияРазделителя = СтрНайти(ПутьФайла, РазделительПути);
    
    Если ПозицияРазделителя = 0 Тогда
    	
        ТекущееИмя = ПутьФайла;
        ПутьФайла = "";
        
    Иначе
    	
        ТекущееИмя = Лев(ПутьФайла, ПозицияРазделителя - 1);
        ПутьФайла = Прав(ПутьФайла, СтрДлина(ПутьФайла) - ПозицияРазделителя);
        
    КонецЕсли;
	
    СтрокаДерева = СтрокиДерева.Найти(ТекущееИмя, "name");
    
    Если СтрокаДерева = Неопределено Тогда
    	
        СтрокаДерева = СтрокиДерева.Добавить();
        СтрокаДерева.name = ТекущееИмя;
        
    КонецЕсли;
    
    СтрокаДерева.id = Новый УникальныйИдентификатор();
    
    Если СтрДлина(ПутьФайла) = 0 Тогда
    	
    	СтрокаДерева.ИндексКартинки = ?(ЭтоКаталог, ИндексКартинкиКаталога(), ИндексКартинкиФайла());
    	СтрокаДерева.ПутьВКаталоге = ПутьВКаталоге;
    	
    	ЗаполнитьЗначенияСвойств(СтрокаДерева, Приложение);
    	
    Иначе
    	СтрокаДерева.ИндексКартинки = ИндексКартинкиКаталога();
        ДобавитьДанныеНастройкиВДерево(СтрокаДерева.Строки, ПутьФайла, РазделительПути, ПутьВКаталоге, Приложение, ЭтоКаталог);
    КонецЕсли;
    
КонецПроцедуры

Процедура ЗаписатьНастройкиДереваВКаталогРекурсивно(ДеревоНастроек, Знач ТекущийКаталог)
	
	Для Каждого СтрокаДерева Из ДеревоНастроек.Строки Цикл
		
		Если СтрокаДерева.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоКаталог = СтрокаДерева.ИндексКартинки = ИндексКартинкиКаталога();
		
		Если ЭтоКаталог И
			СтрокаДерева.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("\/:|*?""<>", СтрокаДерева.name, "");
		
		Если ПустаяСтрока(ИмяОбъекта) Тогда
			ИмяОбъекта = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
		
		ПриложениеКОбъекту = СформироватьПриложениеКОбъекту();
		ЗаполнитьЗначенияСвойств(ПриложениеКОбъекту, СтрокаДерева);
		
		Если ОбщегоНазначения.КоллекцииИдентичны(ПриложениеКОбъекту, СформироватьПриложениеКОбъекту()) Тогда
			ПриложениеКОбъекту = Неопределено;
		КонецЕсли;
		
		Если ЭтоКаталог Тогда
			
			СозданныйКаталог = ЗаписатьОбъектНастройки(ТекущийКаталог, ИмяОбъекта, ПриложениеКОбъекту);
			
			Если СозданныйКаталог <> Неопределено Тогда
				ЗаписатьНастройкиДереваВКаталогРекурсивно(СтрокаДерева, СозданныйКаталог);
			КонецЕсли;
			
		Иначе
			
			Данные = Новый Структура();
			Данные.Вставить("Ключ", СтрокаДерева.key);
			Данные.Вставить("Данные", СтрокаДерева.Данные);
			
			ПутьКОбъекту = ЗаписатьОбъектНастройки(ТекущийКаталог, ИмяОбъекта + ".xml", Данные);
			
			Если ПутьКОбъекту <> Неопределено И ПриложениеКОбъекту <> Неопределено Тогда
				ЗаписатьОбъектНастройки(ТекущийКаталог, ИмяОбъекта + ".json", ПриложениеКОбъекту);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписатьОбъектНастройки(Каталог, ИмяОбъекта, Данные)
	
	ОбъектНастройки = Новый Файл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, ИмяОбъекта));
	
	Если ПустаяСтрока(ОбъектНастройки.Расширение) Тогда
		
		Если Не ОбъектНастройки.Существует() Тогда
			СоздатьКаталог(ОбъектНастройки.ПолноеИмя);
		КонецЕсли;
		
		Если Данные <> Неопределено Тогда
			ЗаписатьОбъектНастройки(Каталог, ИмяОбъекта + ".json", Данные);
		КонецЕсли;
		
	ИначеЕсли ОбъектНастройки.Расширение = ".xml" И Данные <> Неопределено Тогда
		
		ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый ФиксированнаяСтруктура(Данные));
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(ОбъектНастройки.ПолноеИмя);
		ЗаписьXML.ЗаписатьБезОбработки(ДанныеXML);
		ЗаписьXML.Закрыть();
		
	ИначеЕсли ОбъектНастройки.Расширение = ".json" И Данные <> Неопределено  Тогда
		
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.ОткрытьФайл(ОбъектНастройки.ПолноеИмя, , , ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, Данные, , "ПреобразованиеДанныхJSON", Обработки.SUI_ИмпортЭкспортНастроек);
		ЗаписьJSON.Закрыть();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбъектНастройки.ПолноеИмя;
	
КонецФункции

Процедура ВыгрузитьВФайлы_НастройкиДокументов(Каталог, Знач ДеревоНастроек)
	
	ДеревоНастроек.Колонки.Добавить("Данные", Новый ОписаниеТипов("Структура"));
	
	ТаблицаНастроек = Новый ТаблицаЗначений();
	ТаблицаНастроек.Колонки.Добавить("id", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаНастроек.Колонки.Добавить("key", Новый ОписаниеТипов("СправочникСсылка.SUI_НастройкиДокументов"));
	ТаблицаНастроек.Колонки.Добавить("Данные", Новый ОписаниеТипов("Структура"));
	
	НайденныеСтроки = ДеревоНастроек.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина);
	
	Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
		
		СтрокаНастройки = ТаблицаНастроек.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройки, НайденныеСтроки[индекс]);
		
		Если НайденныеСтроки[индекс].key.Пустая() Тогда
			ТаблицаНастроек.Удалить(СтрокаНастройки);
		КонецЕсли;
		
	КонецЦикла;
	
	Справочники.SUI_НастройкиДокументов.СформироватьДанныеДляВыгрузки(ТаблицаНастроек, "key", "Данные");
	
	Если ТаблицаНастроек.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
		
		СтрокаДанных = ТаблицаНастроек.Найти(НайденныеСтроки[индекс].id, "id");
		
		Если СтрокаДанных = Неопределено Тогда
			НайденныеСтроки[индекс].Пометка = 0;
			ПроставитьПометкиВверх(НайденныеСтроки[индекс]);
		Иначе
			НайденныеСтроки[индекс].Данные = СтрокаДанных.Данные;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьНастройкиДереваВКаталогРекурсивно(ДеревоНастроек, Каталог);
	
КонецПроцедуры

Процедура ВыгрузитьВФайлы_НастройкиПодсистемы(Каталог, КоллекцияСтрокДерева)
	
	ВызватьИсключение НСтр("ru = 'Временно недоступно'");
	
КонецПроцедуры

#Область КонфигурационныйФайл

Функция ИмяКонфигурационногоФайлаНастроек()
	
	Возврат "settings.ini";
	
КонецФункции

Функция ЗаписатьКонфигурационныйФайлНастроек(Каталог, Область, Версия = "1")
	
	ОбщегоНазначенияКлиентСервер.Проверить(ОбластиНастроек().Найти(Область) <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Область));
	
	ФайлОписаниеОбласти = Новый ТекстовыйДокумент();
	
	ФайлОписаниеОбласти.ДобавитьСтроку("[General]");
	ФайлОписаниеОбласти.ДобавитьСтроку(СтрШаблон("region=%1", Область));
	ФайлОписаниеОбласти.ДобавитьСтроку(СтрШаблон("version=%1", Версия));
	
	ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, ИмяКонфигурационногоФайлаНастроек());
	
	ФайлОписаниеОбласти.Записать(ПутьКФайлу, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС);
	
	Возврат ПутьКФайлу;
	
КонецФункции

Функция ПрочитатьКонфигурационныйФайлНастроек(Каталог)
	
	КонфигурационныйФайл = Новый Структура();
	КонфигурационныйФайл.Вставить("Область", "");
	КонфигурационныйФайл.Вставить("Версия", 0);
	
	ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, ИмяКонфигурационногоФайлаНастроек());
	
	Файл = Новый Файл(ПутьКФайлу);
	
	ОбщегоНазначенияКлиентСервер.Проверить(Файл.Существует() И Файл.ЭтоФайл(),
		НСтр("ru = 'Отсутствует конфигурационный файл настроек.'"));
	
	Файл = Новый ТекстовыйДокумент();
	Файл.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС);
	
	КоличествоСтрок = Файл.КоличествоСтрок();
	
	Для ТекущийНомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаКонфигурации = СокрЛП(Файл.ПолучитьСтроку(ТекущийНомерСтроки));
		
		Если СтрНачинаетсяС(СтрокаКонфигурации, "region=") Тогда
			КонфигурационныйФайл.Область = СокрЛП(СтрЗаменить(СтрокаКонфигурации, "region=", ""));
		ИначеЕсли СтрНачинаетсяС(СтрокаКонфигурации, "version=") Тогда
			Версия = СтрЗаменить(СтрокаКонфигурации, "version=", "");
			Версия = ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(Версия);
			КонфигурационныйФайл.Версия = Версия;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(КонфигурационныйФайл);
	
КонецФункции

#КонецОбласти

#Область ПриложениеКНастройке

Функция СформироватьПриложениеКОбъекту()
	
	Приложение = Новый Структура();
	Приложение.Вставить("owner_name", "");
	Приложение.Вставить("description", "");
	
	Возврат Приложение;
	
КонецФункции

Функция ПрочитатьФайлПриложениеКНастройке(ПутьКФайлу)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.ОткрытьФайл(ПутьКФайлу);
	Приложение = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Приложение;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДереваНастроек

Процедура ЗаполнитьДеревоНастроек_НастройкиДокументов(НастройкиДерево)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИндексКартинкиФайла", ИндексКартинкиФайла());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_НастройкиДокументов.Представление КАК name,
		|	SUI_НастройкиДокументов.Комментарий КАК description,
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных,
		|	SUI_НастройкиДокументов.Ссылка КАК key,
		|	&ИндексКартинкиФайла КАК ИндексКартинки
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
		СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
		СтрокаДереваРодитель.name = ОбластиНастроек()[0];
		СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВладелецНастройки = Метаданные.Документы.Найти(Выборка.ИмяОбъектаМетаданных);
			
			Если ВладелецНастройки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
			
			СтрокаДерева.id = Новый УникальныйИдентификатор();
			СтрокаДерева.owner_name = ВладелецНастройки.ПолноеИмя();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы(НастройкиДерево)
	
	СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
	СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
	СтрокаДереваРодитель.name = ОбластиНастроек()[1];
	СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
	
	// Настройки таблиц интеграции
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции(СтрокаДереваРодитель);
	
	// Пользовательские запросы
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ДополнительныеНастройкиТаблицИнтеграции(СтрокаДереваРодитель);
	
	// Пользовательские запросы
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ПользовательскиеЗапросы(СтрокаДереваРодитель);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции(НастройкиДерево)
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек();
	ПараметрыПолученияНастроек.Используется = Неопределено;
	ПараметрыПолученияНастроек.Настраиваемая = Неопределено;
	ПараметрыПолученияНастроек.ПолучитьДерево = Истина;
	
	НастройкиТаблиц = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	
	Если НастройкиТаблиц.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = НастройкиДерево.Строки.Добавить();
	СтрокаДерева.ИндексКартинки = ИндексКартинкиКаталога();
	СтрокаДерева.name = НСтр("ru = 'Таблицы интеграции'");
	СтрокаДерева.id = Новый УникальныйИдентификатор();
	
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции_ЗаполнитьРекурсивно(
		СтрокаДерева.Строки, НастройкиТаблиц.Строки);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции_ЗаполнитьРекурсивно(
	НастройкиДерево, НастройкиТаблиц)
	
	Для Каждого НастройкаТаблицы Из НастройкиТаблиц Цикл
		
		НастройкаДерева = НастройкиДерево.Добавить();
		НастройкаДерева.id = Новый УникальныйИдентификатор();
		
		Если НастройкаТаблицы.Строки.Количество() > 0 Тогда
			
			НастройкаДерева.name = НастройкаТаблицы.ТаблицаИнтеграции;
			НастройкаДерева.ИндексКартинки = ИндексКартинкиКаталога();
			
			ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции_ЗаполнитьРекурсивно(
				НастройкаДерева.Строки, НастройкаТаблицы.Строки);
			
		Иначе
			
			КлючВНастройку = Новый Массив();
			КлючВНастройку.Добавить(НастройкаТаблицы.ТаблицаИнтеграции);
			КлючВНастройку.Добавить(НастройкаТаблицы.ИмяОбъекта);
			
			НастройкаДерева.name = НастройкаТаблицы.ИмяОбъекта;
			НастройкаДерева.ИндексКартинки = ИндексКартинкиФайла();
			НастройкаДерева.key = КлючВНастройку;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ДополнительныеНастройкиТаблицИнтеграции(НастройкиДерево)
	
	ДополнительныеНастройки = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции
		.ПолучитьДополнительныеНастройки();
	
	Если ДополнительныеНастройки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
	СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
	СтрокаДереваРодитель.name = НСтр("ru = 'Дополнительные настройки таблиц'");
	СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
	
	Для Каждого ДополнительнаяНастройка Из ДополнительныеНастройки Цикл
		
		СтрокаДополнительнойНастройки = СтрокаДереваРодитель.Строки.Добавить();
		СтрокаДополнительнойНастройки.id = Новый УникальныйИдентификатор();
		СтрокаДополнительнойНастройки.name = ДополнительнаяНастройка.Ключ;
		СтрокаДополнительнойНастройки.ИндексКартинки = ИндексКартинкиФайла();
		СтрокаДополнительнойНастройки.key = ДополнительнаяНастройка.Ключ;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ПользовательскиеЗапросы(НастройкиДерево)
	
	СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
	СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
	СтрокаДереваРодитель.name = НСтр("ru = 'Запросы данных'");
	СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
	
	СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
	СтрокаДерева.id = Новый УникальныйИдентификатор();
	СтрокаДерева.ИндексКартинки = ИндексКартинкиФайла();
	СтрокаДерева.name = НСтр("ru = 'Пользовательский запрос'");
	СтрокаДерева.key = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Метаданные.Константы.SUI_ПользовательскийЗапрос.ПолноеИмя());
	
	СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
	СтрокаДерева.id = Новый УникальныйИдентификатор();
	СтрокаДерева.ИндексКартинки = ИндексКартинкиФайла();
	СтрокаДерева.name = НСтр("ru = 'Запрос получения остатков и цен'");
	СтрокаДерева.key = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Метаданные.Константы.SUI_ЗапросПолученияОстатковИЦен.ПолноеИмя());
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_ИзФайлаВыгрузки(ДеревоНастроек, ДанныеФайла, Область)
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	РазделительПути = ПолучитьРазделительПути();
	
	Попытка
		
		ФайлАрхив = Новый ЧтениеZipФайла(ДанныеФайла.ОткрытьПотокДляЧтения());
		ФайлАрхив.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		ФайлАрхив.Закрыть();
		
		КонфигурационныйФайл = ПрочитатьКонфигурационныйФайлНастроек(ВременныйКаталог);
		
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(КонфигурационныйФайл.Область),
			НСтр("ru = 'Конфигурационный файл настроек поврежден.'"));
		
		ОбщегоНазначенияКлиентСервер.Проверить(Область = КонфигурационныйФайл.Область,
			СтрШаблон(НСтр("ru = 'Файл настроек ""%1"" не принадлежит области настроек ""%2"".'"), 
			КонфигурационныйФайл.Область, Область));
		
		Для Каждого ФайлПриложения Из НайтиФайлы(ВременныйКаталог, "*.json", Истина) Цикл
			
			Если Не ФайлПриложения.ЭтоФайл() Тогда
				Продолжить;
			КонецЕсли;
			
			ПутьКФайлуОбъекту = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
				ФайлПриложения.Путь, ФайлПриложения.ИмяБезРасширения);
			
			ФайлОбъект = Новый Файл(ПутьКФайлуОбъекту + ".xml");
			
			Если Не ФайлОбъект.Существует() Тогда
				ФайлОбъект = Новый Файл(ПутьКФайлуОбъекту);
				Если Не ФайлОбъект.Существует() Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Приложение = ПрочитатьФайлПриложениеКНастройке(ФайлПриложения.ПолноеИмя);
			
			ПутьКФайлуВКаталоге = СтрЗаменить(ПутьКФайлуОбъекту, ВременныйКаталог, "");
			
			ДобавитьДанныеНастройкиВДерево(ДеревоНастроек.Строки, 
				ПутьКФайлуВКаталоге, 
				РазделительПути, 
				СтрЗаменить(ФайлОбъект.ПолноеИмя, ВременныйКаталог, ""),
				Приложение,
				ФайлОбъект.ЭтоКаталог());
		    
		КонецЦикла;
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Загрузка из файла'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_ИзСхемы(ДеревоНастроек, СхемаJSON, Область)
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
